app/controllers/api/parks_controller.rb

    def show
        @park = Park.find_by(id: params[:id])
---
SELECT "parks".* FROM "parks" WHERE "parks"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]