app/controllers/api/trails_controller.rb

    def index
        puts "HI2"
        @trails = Trail.all;
---
SELECT "trails".* FROM "trails"

    def show
        @trail = Trail.find_by(id: params[:id])
---
SELECT "trails".* FROM "trails" WHERE "trails"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]