trailblazer/app/controllers/api/sessions_controller.rb

  def create
    p User.first
---
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]