trailblazer/app/controllers/application_controller.rb

SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
    def test
        if params.has_key?(:login)
          login!(User.first)